IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CBASS0_FW.xml
	<register id="FW_REGS_Imsram32kx64e_main_5_slv_fw_region_1_permission_1" acronym="FW_REGS_Imsram32kx64e_main_5_slv_fw_region_1_permission_1" offset="0x4428" width="32" description="The FW Region 1 Permission 1 Register defines the permissions for the slave Imsram32kx64e_main_5.slv region 1 firewall.">
		<bitfield id="PRIV_ID" width="8" begin="23" end="16" resetval="0x0" description="Allowed privid." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_DEBUG" width="1" begin="15" end="15" resetval="0x0" description="Non-secure user debug allowed." range="15" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_CACHEABLE" width="1" begin="14" end="14" resetval="0x0" description="Non-secure user cacheable allowed." range="14" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_READ" width="1" begin="13" end="13" resetval="0x0" description="Non-secure user read allowed." range="13" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_WRITE" width="1" begin="12" end="12" resetval="0x0" description="Non-secure user write allowed." range="12" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Non-secure supervisor debug allowed." range="11" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Non-secure supervisor cacheable allowed." range="10" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_READ" width="1" begin="9" end="9" resetval="0x0" description="Non-secure supervisor read allowed." range="9" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_WRITE" width="1" begin="8" end="8" resetval="0x0" description="Non-secure supervisor write allowed." range="8" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_DEBUG" width="1" begin="7" end="7" resetval="0x0" description="Secure user debug allowed." range="7" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_CACHEABLE" width="1" begin="6" end="6" resetval="0x0" description="Secure user cacheable allowed." range="6" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_READ" width="1" begin="5" end="5" resetval="0x0" description="Secure user read allowed." range="5" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_WRITE" width="1" begin="4" end="4" resetval="0x0" description="Secure user write allowed." range="4" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_DEBUG" width="1" begin="3" end="3" resetval="0x0" description="Secure supervisor debug allowed." range="3" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_CACHEABLE" width="1" begin="2" end="2" resetval="0x0" description="Secure supervisor cacheable allowed." range="2" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_READ" width="1" begin="1" end="1" resetval="0x0" description="Secure supervisor read allowed." range="1" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_WRITE" width="1" begin="0" end="0" resetval="0x0" description="Secure supervisor write allowed." range="0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_Imsram32kx64e_main_5_slv_fw_region_1_permission_2" acronym="FW_REGS_Imsram32kx64e_main_5_slv_fw_region_1_permission_2" offset="0x442C" width="32" description="The FW Region 1 Permission 2 Register defines the permissions for the slave Imsram32kx64e_main_5.slv region 1 firewall.">
		<bitfield id="PRIV_ID" width="8" begin="23" end="16" resetval="0x0" description="Allowed privid." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_DEBUG" width="1" begin="15" end="15" resetval="0x0" description="Non-secure user debug allowed." range="15" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_CACHEABLE" width="1" begin="14" end="14" resetval="0x0" description="Non-secure user cacheable allowed." range="14" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_READ" width="1" begin="13" end="13" resetval="0x0" description="Non-secure user read allowed." range="13" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_WRITE" width="1" begin="12" end="12" resetval="0x0" description="Non-secure user write allowed." range="12" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Non-secure supervisor debug allowed." range="11" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Non-secure supervisor cacheable allowed." range="10" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_READ" width="1" begin="9" end="9" resetval="0x0" description="Non-secure supervisor read allowed." range="9" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_WRITE" width="1" begin="8" end="8" resetval="0x0" description="Non-secure supervisor write allowed." range="8" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_DEBUG" width="1" begin="7" end="7" resetval="0x0" description="Secure user debug allowed." range="7" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_CACHEABLE" width="1" begin="6" end="6" resetval="0x0" description="Secure user cacheable allowed." range="6" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_READ" width="1" begin="5" end="5" resetval="0x0" description="Secure user read allowed." range="5" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_WRITE" width="1" begin="4" end="4" resetval="0x0" description="Secure user write allowed." range="4" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_DEBUG" width="1" begin="3" end="3" resetval="0x0" description="Secure supervisor debug allowed." range="3" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_CACHEABLE" width="1" begin="2" end="2" resetval="0x0" description="Secure supervisor cacheable allowed." range="2" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_READ" width="1" begin="1" end="1" resetval="0x0" description="Secure supervisor read allowed." range="1" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_WRITE" width="1" begin="0" end="0" resetval="0x0" description="Secure supervisor write allowed." range="0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_Imsram32kx64e_main_5_slv_fw_region_1_start_address_l" acronym="FW_REGS_Imsram32kx64e_main_5_slv_fw_region_1_start_address_l" offset="0x4430" width="32" description="The FW Region 1 Start Address Low Register defines the start address bits 31 to 0 for the slave Imsram32kx64e_main_5.slv region 1 firewall.">
		<bitfield id="START_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="Start address bits 31 to 12. Lowest 12 bits are forced to 0 as address must be 4KB aligned." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="START_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x0" description="Start address bits 11 to 0 are forced to 0 as address must be 4KB aligned." range="11 - 0" rwaccess="R"/>
	</register>
	<register id="FW_REGS_Imsram32kx64e_main_5_slv_fw_region_1_start_address_h" acronym="FW_REGS_Imsram32kx64e_main_5_slv_fw_region_1_start_address_h" offset="0x4434" width="32" description="The FW Region 1 Start Address High Register defines the start address bits 47 to 32 for the slave Imsram32kx64e_main_5.slv region 1 firewall.">
		<bitfield id="START_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="Start address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
