IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CBASS0_FW.xml
	<register id="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_3_end_address_l" acronym="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_3_end_address_l" offset="0x5878" width="32" description="The FW Region 3 End Address Low Register defines the end address bits 31 to 0 to include for the slave br_scrm_64b_clk2_to_scrp_misc_clk2_l0 region 3 firewall.">
		<bitfield id="END_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="End address bits 31 to 12 to include in the match. Lowest 12 bits are forced to 1s as address must be 4KB aligned." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="END_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x4095" description="End address bits 11 to 0 are forced to 1s as address must be 4KB aligned minus 1." range="11 - 0" rwaccess="R"/>
	</register>
	<register id="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_3_end_address_h" acronym="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_3_end_address_h" offset="0x587C" width="32" description="The FW Region 3 End Address High Register defines the end address bits 47 to 32 to include for the slave br_scrm_64b_clk2_to_scrp_misc_clk2_l0 region 3 firewall.">
		<bitfield id="END_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="End address bits 47 to 32 to include in the match." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_control" acronym="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_control" offset="0x5880" width="32" description="The FW Region 4 Control Register defines the control fields for the slave br_scrm_64b_clk2_to_scrp_misc_clk2_l0 region 4 firewall.">
		<bitfield id="CACHE_MODE" width="1" begin="9" end="9" resetval="0x0" description="Cache mode for region. Set to 1 to check cache permissions. Set to 0 to ignore cache permissions." range="9" rwaccess="R/W"/> 
		<bitfield id="BACKGROUND" width="1" begin="8" end="8" resetval="0x0" description="Background enable for region. There can be 1 backgroun region per FW and foreground regions can have overlapping addresses only with the background region." range="8" rwaccess="R/W"/> 
		<bitfield id="LOCK" width="1" begin="4" end="4" resetval="0x0" description="Lock region. Once set region values cannot be modified." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="ENABLE" width="4" begin="3" end="0" resetval="0x0" description="Enable region. A value of 0xA enables, others disable." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_permission_0" acronym="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_permission_0" offset="0x5884" width="32" description="The FW Region 4 Permission 0 Register defines the permissions for the slave br_scrm_64b_clk2_to_scrp_misc_clk2_l0 region 4 firewall.">
		<bitfield id="PRIV_ID" width="8" begin="23" end="16" resetval="0x0" description="Allowed privid." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_DEBUG" width="1" begin="15" end="15" resetval="0x0" description="Non-secure user debug allowed." range="15" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_CACHEABLE" width="1" begin="14" end="14" resetval="0x0" description="Non-secure user cacheable allowed." range="14" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_READ" width="1" begin="13" end="13" resetval="0x0" description="Non-secure user read allowed." range="13" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_WRITE" width="1" begin="12" end="12" resetval="0x0" description="Non-secure user write allowed." range="12" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Non-secure supervisor debug allowed." range="11" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Non-secure supervisor cacheable allowed." range="10" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_READ" width="1" begin="9" end="9" resetval="0x0" description="Non-secure supervisor read allowed." range="9" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_WRITE" width="1" begin="8" end="8" resetval="0x0" description="Non-secure supervisor write allowed." range="8" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_DEBUG" width="1" begin="7" end="7" resetval="0x0" description="Secure user debug allowed." range="7" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_CACHEABLE" width="1" begin="6" end="6" resetval="0x0" description="Secure user cacheable allowed." range="6" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_READ" width="1" begin="5" end="5" resetval="0x0" description="Secure user read allowed." range="5" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_WRITE" width="1" begin="4" end="4" resetval="0x0" description="Secure user write allowed." range="4" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_DEBUG" width="1" begin="3" end="3" resetval="0x0" description="Secure supervisor debug allowed." range="3" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_CACHEABLE" width="1" begin="2" end="2" resetval="0x0" description="Secure supervisor cacheable allowed." range="2" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_READ" width="1" begin="1" end="1" resetval="0x0" description="Secure supervisor read allowed." range="1" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_WRITE" width="1" begin="0" end="0" resetval="0x0" description="Secure supervisor write allowed." range="0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_permission_1" acronym="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_permission_1" offset="0x5888" width="32" description="The FW Region 4 Permission 1 Register defines the permissions for the slave br_scrm_64b_clk2_to_scrp_misc_clk2_l0 region 4 firewall.">
		<bitfield id="PRIV_ID" width="8" begin="23" end="16" resetval="0x0" description="Allowed privid." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_DEBUG" width="1" begin="15" end="15" resetval="0x0" description="Non-secure user debug allowed." range="15" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_CACHEABLE" width="1" begin="14" end="14" resetval="0x0" description="Non-secure user cacheable allowed." range="14" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_READ" width="1" begin="13" end="13" resetval="0x0" description="Non-secure user read allowed." range="13" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_WRITE" width="1" begin="12" end="12" resetval="0x0" description="Non-secure user write allowed." range="12" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Non-secure supervisor debug allowed." range="11" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Non-secure supervisor cacheable allowed." range="10" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_READ" width="1" begin="9" end="9" resetval="0x0" description="Non-secure supervisor read allowed." range="9" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_WRITE" width="1" begin="8" end="8" resetval="0x0" description="Non-secure supervisor write allowed." range="8" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_DEBUG" width="1" begin="7" end="7" resetval="0x0" description="Secure user debug allowed." range="7" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_CACHEABLE" width="1" begin="6" end="6" resetval="0x0" description="Secure user cacheable allowed." range="6" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_READ" width="1" begin="5" end="5" resetval="0x0" description="Secure user read allowed." range="5" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_WRITE" width="1" begin="4" end="4" resetval="0x0" description="Secure user write allowed." range="4" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_DEBUG" width="1" begin="3" end="3" resetval="0x0" description="Secure supervisor debug allowed." range="3" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_CACHEABLE" width="1" begin="2" end="2" resetval="0x0" description="Secure supervisor cacheable allowed." range="2" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_READ" width="1" begin="1" end="1" resetval="0x0" description="Secure supervisor read allowed." range="1" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_WRITE" width="1" begin="0" end="0" resetval="0x0" description="Secure supervisor write allowed." range="0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_permission_2" acronym="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_permission_2" offset="0x588C" width="32" description="The FW Region 4 Permission 2 Register defines the permissions for the slave br_scrm_64b_clk2_to_scrp_misc_clk2_l0 region 4 firewall.">
		<bitfield id="PRIV_ID" width="8" begin="23" end="16" resetval="0x0" description="Allowed privid." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_DEBUG" width="1" begin="15" end="15" resetval="0x0" description="Non-secure user debug allowed." range="15" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_CACHEABLE" width="1" begin="14" end="14" resetval="0x0" description="Non-secure user cacheable allowed." range="14" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_READ" width="1" begin="13" end="13" resetval="0x0" description="Non-secure user read allowed." range="13" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_WRITE" width="1" begin="12" end="12" resetval="0x0" description="Non-secure user write allowed." range="12" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Non-secure supervisor debug allowed." range="11" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Non-secure supervisor cacheable allowed." range="10" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_READ" width="1" begin="9" end="9" resetval="0x0" description="Non-secure supervisor read allowed." range="9" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_WRITE" width="1" begin="8" end="8" resetval="0x0" description="Non-secure supervisor write allowed." range="8" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_DEBUG" width="1" begin="7" end="7" resetval="0x0" description="Secure user debug allowed." range="7" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_CACHEABLE" width="1" begin="6" end="6" resetval="0x0" description="Secure user cacheable allowed." range="6" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_READ" width="1" begin="5" end="5" resetval="0x0" description="Secure user read allowed." range="5" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_WRITE" width="1" begin="4" end="4" resetval="0x0" description="Secure user write allowed." range="4" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_DEBUG" width="1" begin="3" end="3" resetval="0x0" description="Secure supervisor debug allowed." range="3" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_CACHEABLE" width="1" begin="2" end="2" resetval="0x0" description="Secure supervisor cacheable allowed." range="2" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_READ" width="1" begin="1" end="1" resetval="0x0" description="Secure supervisor read allowed." range="1" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_WRITE" width="1" begin="0" end="0" resetval="0x0" description="Secure supervisor write allowed." range="0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_start_address_l" acronym="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_start_address_l" offset="0x5890" width="32" description="The FW Region 4 Start Address Low Register defines the start address bits 31 to 0 for the slave br_scrm_64b_clk2_to_scrp_misc_clk2_l0 region 4 firewall.">
		<bitfield id="START_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="Start address bits 31 to 12. Lowest 12 bits are forced to 0 as address must be 4KB aligned." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="START_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x0" description="Start address bits 11 to 0 are forced to 0 as address must be 4KB aligned." range="11 - 0" rwaccess="R"/>
	</register>
	<register id="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_start_address_h" acronym="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_start_address_h" offset="0x5894" width="32" description="The FW Region 4 Start Address High Register defines the start address bits 47 to 32 for the slave br_scrm_64b_clk2_to_scrp_misc_clk2_l0 region 4 firewall.">
		<bitfield id="START_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="Start address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_end_address_l" acronym="FW_REGS_br_scrm_64b_clk2_to_scrp_misc_clk2_l0_fw_region_4_end_address_l" offset="0x5898" width="32" description="The FW Region 4 End Address Low Register defines the end address bits 31 to 0 to include for the slave br_scrm_64b_clk2_to_scrp_misc_clk2_l0 region 4 firewall.">
		<bitfield id="END_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="End address bits 31 to 12 to include in the match. Lowest 12 bits are forced to 1s as address must be 4KB aligned." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="END_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x4095" description="End address bits 11 to 0 are forced to 1s as address must be 4KB aligned minus 1." range="11 - 0" rwaccess="R"/>
	</register>
