IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CBASS0_FW.xml
	<register id="FW_REGS_Imsram32kx64e_main_7_slv_fw_region_2_permission_0" acronym="FW_REGS_Imsram32kx64e_main_7_slv_fw_region_2_permission_0" offset="0x6044" width="32" description="The FW Region 2 Permission 0 Register defines the permissions for the slave Imsram32kx64e_main_7.slv region 2 firewall.">
		<bitfield id="PRIV_ID" width="8" begin="23" end="16" resetval="0x0" description="Allowed privid." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_DEBUG" width="1" begin="15" end="15" resetval="0x0" description="Non-secure user debug allowed." range="15" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_CACHEABLE" width="1" begin="14" end="14" resetval="0x0" description="Non-secure user cacheable allowed." range="14" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_READ" width="1" begin="13" end="13" resetval="0x0" description="Non-secure user read allowed." range="13" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_WRITE" width="1" begin="12" end="12" resetval="0x0" description="Non-secure user write allowed." range="12" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Non-secure supervisor debug allowed." range="11" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Non-secure supervisor cacheable allowed." range="10" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_READ" width="1" begin="9" end="9" resetval="0x0" description="Non-secure supervisor read allowed." range="9" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_WRITE" width="1" begin="8" end="8" resetval="0x0" description="Non-secure supervisor write allowed." range="8" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_DEBUG" width="1" begin="7" end="7" resetval="0x0" description="Secure user debug allowed." range="7" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_CACHEABLE" width="1" begin="6" end="6" resetval="0x0" description="Secure user cacheable allowed." range="6" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_READ" width="1" begin="5" end="5" resetval="0x0" description="Secure user read allowed." range="5" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_WRITE" width="1" begin="4" end="4" resetval="0x0" description="Secure user write allowed." range="4" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_DEBUG" width="1" begin="3" end="3" resetval="0x0" description="Secure supervisor debug allowed." range="3" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_CACHEABLE" width="1" begin="2" end="2" resetval="0x0" description="Secure supervisor cacheable allowed." range="2" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_READ" width="1" begin="1" end="1" resetval="0x0" description="Secure supervisor read allowed." range="1" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_WRITE" width="1" begin="0" end="0" resetval="0x0" description="Secure supervisor write allowed." range="0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_Imsram32kx64e_main_7_slv_fw_region_2_permission_1" acronym="FW_REGS_Imsram32kx64e_main_7_slv_fw_region_2_permission_1" offset="0x6048" width="32" description="The FW Region 2 Permission 1 Register defines the permissions for the slave Imsram32kx64e_main_7.slv region 2 firewall.">
		<bitfield id="PRIV_ID" width="8" begin="23" end="16" resetval="0x0" description="Allowed privid." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_DEBUG" width="1" begin="15" end="15" resetval="0x0" description="Non-secure user debug allowed." range="15" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_CACHEABLE" width="1" begin="14" end="14" resetval="0x0" description="Non-secure user cacheable allowed." range="14" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_READ" width="1" begin="13" end="13" resetval="0x0" description="Non-secure user read allowed." range="13" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_WRITE" width="1" begin="12" end="12" resetval="0x0" description="Non-secure user write allowed." range="12" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Non-secure supervisor debug allowed." range="11" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Non-secure supervisor cacheable allowed." range="10" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_READ" width="1" begin="9" end="9" resetval="0x0" description="Non-secure supervisor read allowed." range="9" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_WRITE" width="1" begin="8" end="8" resetval="0x0" description="Non-secure supervisor write allowed." range="8" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_DEBUG" width="1" begin="7" end="7" resetval="0x0" description="Secure user debug allowed." range="7" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_CACHEABLE" width="1" begin="6" end="6" resetval="0x0" description="Secure user cacheable allowed." range="6" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_READ" width="1" begin="5" end="5" resetval="0x0" description="Secure user read allowed." range="5" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_WRITE" width="1" begin="4" end="4" resetval="0x0" description="Secure user write allowed." range="4" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_DEBUG" width="1" begin="3" end="3" resetval="0x0" description="Secure supervisor debug allowed." range="3" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_CACHEABLE" width="1" begin="2" end="2" resetval="0x0" description="Secure supervisor cacheable allowed." range="2" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_READ" width="1" begin="1" end="1" resetval="0x0" description="Secure supervisor read allowed." range="1" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_WRITE" width="1" begin="0" end="0" resetval="0x0" description="Secure supervisor write allowed." range="0" rwaccess="R/W"/>
	</register>
	<register id="FW_REGS_Imsram32kx64e_main_7_slv_fw_region_2_permission_2" acronym="FW_REGS_Imsram32kx64e_main_7_slv_fw_region_2_permission_2" offset="0x604C" width="32" description="The FW Region 2 Permission 2 Register defines the permissions for the slave Imsram32kx64e_main_7.slv region 2 firewall.">
		<bitfield id="PRIV_ID" width="8" begin="23" end="16" resetval="0x0" description="Allowed privid." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_DEBUG" width="1" begin="15" end="15" resetval="0x0" description="Non-secure user debug allowed." range="15" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_CACHEABLE" width="1" begin="14" end="14" resetval="0x0" description="Non-secure user cacheable allowed." range="14" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_READ" width="1" begin="13" end="13" resetval="0x0" description="Non-secure user read allowed." range="13" rwaccess="R/W"/> 
		<bitfield id="NONSEC_USER_WRITE" width="1" begin="12" end="12" resetval="0x0" description="Non-secure user write allowed." range="12" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Non-secure supervisor debug allowed." range="11" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Non-secure supervisor cacheable allowed." range="10" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_READ" width="1" begin="9" end="9" resetval="0x0" description="Non-secure supervisor read allowed." range="9" rwaccess="R/W"/> 
		<bitfield id="NONSEC_SUPV_WRITE" width="1" begin="8" end="8" resetval="0x0" description="Non-secure supervisor write allowed." range="8" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_DEBUG" width="1" begin="7" end="7" resetval="0x0" description="Secure user debug allowed." range="7" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_CACHEABLE" width="1" begin="6" end="6" resetval="0x0" description="Secure user cacheable allowed." range="6" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_READ" width="1" begin="5" end="5" resetval="0x0" description="Secure user read allowed." range="5" rwaccess="R/W"/> 
		<bitfield id="SEC_USER_WRITE" width="1" begin="4" end="4" resetval="0x0" description="Secure user write allowed." range="4" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_DEBUG" width="1" begin="3" end="3" resetval="0x0" description="Secure supervisor debug allowed." range="3" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_CACHEABLE" width="1" begin="2" end="2" resetval="0x0" description="Secure supervisor cacheable allowed." range="2" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_READ" width="1" begin="1" end="1" resetval="0x0" description="Secure supervisor read allowed." range="1" rwaccess="R/W"/> 
		<bitfield id="SEC_SUPV_WRITE" width="1" begin="0" end="0" resetval="0x0" description="Secure supervisor write allowed." range="0" rwaccess="R/W"/>
	</register>
